// খুব ভালো\! আপনি যেহেতু আরও **জটিল (Complex)** এবং **ES6+ নির্ভর** প্রশ্ন চাচ্ছেন, আমরা এখন **অ্যাডভান্সড ফাংশন টেকনিক, মডিউল এবং অ্যারে মেথডের গভীরতা** নিয়ে কুইজ শুরু করব। এগুলো বড় আকারের প্রজেক্টে ডেটা ম্যানেজমেন্টের জন্য অপরিহার্য।

// -----

// ## 🚀 স্তর ৩: অ্যাডভান্সড JS এবং ফাংশনাল প্রোগ্রামিং (Advanced ES6 & Functional)

// ### ❓ প্রশ্ন ১: অ্যারে মেথড: `map` vs `filter`

// ধরে নিন আপনার কাছে এই ভিডিও লিস্টটি আছে:

//todo javascript
const videos = [
  { id: 1, title: 'HTML Basics', duration: 120, paid: false },
  { id: 2, title: 'Tailwind CSS', duration: 350, paid: false },
  { id: 3, title: 'JS Async Await', duration: 480, paid: true }
];

const result = videos.map((item)=> item.title ) ;
console.log(result) ;

// qn 2 : 
const free = videos.filter((item)=> !(item.paid));
console.log(free)

// **আপনার প্রশ্ন:** এই লিস্ট থেকে আপনি দুটি ভিন্ন কাজ করতে চান:

// 1.  **`map()`** ব্যবহার করে শুধুমাত্র ভিডিওগুলির **`title`** সম্বলিত একটি নতুন অ্যারে তৈরি করুন।
// 2.  **`filter()`** ব্যবহার করে শুধুমাত্র **ফ্রি (`paid: false`)** ভিডিওগুলির লিস্ট তৈরি করুন।

// প্রয়োজনীয় দুটি কোড লিখুন।
